## 
## Cadence First Encounter "v08.10-p004_1 ((32bit) 11/04/2008 14:34 (Linux 2.6))"
## Fri Oct  6 01:38:50 2023
## 
set sdc_version 1.4
current_design SYS_TOP
create_clock [get_ports {UART_CLK}]  -name UART_CLK -period 271.267 -waveform {0 135.634}
set_clock_latency -min 0 [get_clocks {UART_CLK}]
set_clock_latency -max 0 [get_clocks {UART_CLK}]
set_clock_transition  -rise -min 0.05 [get_clocks {UART_CLK}]
set_clock_transition  -rise -max 0.05 [get_clocks {UART_CLK}]
set_clock_transition  -fall -min 0.05 [get_clocks {UART_CLK}]
set_clock_transition  -fall -max 0.05 [get_clocks {UART_CLK}]
create_clock [get_ports {REF_CLK}]  -name REF_CLK -period 10 -waveform {0 5}
set_clock_latency -min 0 [get_clocks {REF_CLK}]
set_clock_latency -max 0 [get_clocks {REF_CLK}]
set_clock_transition  -rise -min 0.05 [get_clocks {REF_CLK}]
set_clock_transition  -rise -max 0.05 [get_clocks {REF_CLK}]
set_clock_transition  -fall -min 0.05 [get_clocks {REF_CLK}]
set_clock_transition  -fall -max 0.05 [get_clocks {REF_CLK}]
create_clock [get_ports {scan_clk}]  -name SCAN_CLK -period 100 -waveform {0 50}
set_clock_latency -min 0 [get_clocks {SCAN_CLK}]
set_clock_latency -max 0 [get_clocks {SCAN_CLK}]
set_clock_transition  -rise -min 0.05 [get_clocks {SCAN_CLK}]
set_clock_transition  -rise -max 0.05 [get_clocks {SCAN_CLK}]
set_clock_transition  -fall -min 0.05 [get_clocks {SCAN_CLK}]
set_clock_transition  -fall -max 0.05 [get_clocks {SCAN_CLK}]
create_generated_clock -name GATED_CLK -source [get_ports {REF_CLK}] -divide_by 1 -master_clock [get_clocks {REF_CLK}] -add [get_pins {clkGate/u0/ECK}]
create_generated_clock -name TX_CLK -source [get_ports {UART_CLK}] -divide_by 32 -master_clock [get_clocks {UART_CLK}] -add [get_pins {u0/U34/Y}]
create_generated_clock -name RX_CLK -source [get_ports {UART_CLK}] -divide_by 1 -master_clock [get_clocks {UART_CLK}] -add [get_pins {u1/U35/Y}]
set_propagated_clock  [get_pins {clkGate/u0/ECK}]
set_propagated_clock  [get_ports {UART_CLK}]
set_propagated_clock  [get_pins {u1/U35/Y}]
set_propagated_clock  [get_ports {scan_clk}]
set_propagated_clock  [get_pins {u0/U34/Y}]
set_propagated_clock  [get_ports {REF_CLK}]
set_clock_latency -min 0 [get_clocks {TX_CLK}]
set_clock_latency -max 0 [get_clocks {TX_CLK}]
set_clock_transition  -rise -min 0.05 [get_clocks {TX_CLK}]
set_clock_transition  -rise -max 0.05 [get_clocks {TX_CLK}]
set_clock_transition  -fall -min 0.05 [get_clocks {TX_CLK}]
set_clock_transition  -fall -max 0.05 [get_clocks {TX_CLK}]
set_clock_latency -min 0 [get_clocks {GATED_CLK}]
set_clock_latency -max 0 [get_clocks {GATED_CLK}]
set_clock_transition  -rise -min 0.05 [get_clocks {GATED_CLK}]
set_clock_transition  -rise -max 0.05 [get_clocks {GATED_CLK}]
set_clock_transition  -fall -min 0.05 [get_clocks {GATED_CLK}]
set_clock_transition  -fall -max 0.05 [get_clocks {GATED_CLK}]
set_clock_latency -min 0 [get_clocks {RX_CLK}]
set_clock_latency -max 0 [get_clocks {RX_CLK}]
set_clock_transition  -rise -min 0.05 [get_clocks {RX_CLK}]
set_clock_transition  -rise -max 0.05 [get_clocks {RX_CLK}]
set_clock_transition  -fall -min 0.05 [get_clocks {RX_CLK}]
set_clock_transition  -fall -max 0.05 [get_clocks {RX_CLK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {RX_IN}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {RX_IN}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {RX_IN}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {RX_IN}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {SI[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {SI[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {SI[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {SI[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {SI[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {SI[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {SI[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {SI[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {SI[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {SI[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {SI[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {SI[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {SI[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {SI[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {SI[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {SI[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {SE}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {SE}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {SE}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {SE}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {test_mode}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {test_mode}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {test_mode}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {test_mode}]
set_load -pin_load -max  0.1  [get_ports {SO[3]}]
set_load -pin_load -min  0.1  [get_ports {SO[3]}]
set_load -pin_load -max  0.1  [get_ports {SO[2]}]
set_load -pin_load -min  0.1  [get_ports {SO[2]}]
set_load -pin_load -max  0.1  [get_ports {SO[1]}]
set_load -pin_load -min  0.1  [get_ports {SO[1]}]
set_load -pin_load -max  0.1  [get_ports {SO[0]}]
set_load -pin_load -min  0.1  [get_ports {SO[0]}]
set_load -pin_load -max  0.5  [get_ports {TX_OUT}]
set_load -pin_load -min  0.5  [get_ports {TX_OUT}]
set_load -pin_load -max  0.5  [get_ports {parity_error}]
set_load -pin_load -min  0.5  [get_ports {parity_error}]
set_load -pin_load -max  0.5  [get_ports {frame_error}]
set_load -pin_load -min  0.5  [get_ports {frame_error}]
set_case_analysis 0 [get_ports {SE}]
set_case_analysis 1 [get_ports {test_mode}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SE}]
set_input_delay -add_delay 54.2535 -clock [get_clocks {UART_CLK}] [get_ports {RX_IN}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {test_mode}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SI[2]}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SI[0]}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SI[3]}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SI[1]}]
set_output_delay -add_delay 20 -clock [get_clocks {RX_CLK}] [get_ports {SO[3]}]
set_output_delay -add_delay 20 -clock [get_clocks {RX_CLK}] [get_ports {SO[1]}]
set_output_delay -add_delay 1736.11 -clock [get_clocks {TX_CLK}] [get_ports {TX_OUT}]
set_output_delay -add_delay 54.2535 -clock [get_clocks {RX_CLK}] [get_ports {frame_error}]
set_output_delay -add_delay 20 -clock [get_clocks {RX_CLK}] [get_ports {SO[2]}]
set_output_delay -add_delay 54.2535 -clock [get_clocks {RX_CLK}] [get_ports {parity_error}]
set_output_delay -add_delay 20 -clock [get_clocks {RX_CLK}] [get_ports {SO[0]}]
set_clock_uncertainty 0.1 -hold [get_clocks {UART_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {UART_CLK}]
set_clock_uncertainty 0.1 -hold [get_clocks {REF_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {REF_CLK}]
set_clock_uncertainty 0.1 -hold [get_clocks {TX_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {TX_CLK}]
set_clock_uncertainty 0.1 -hold [get_clocks {RX_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {RX_CLK}]
set_clock_uncertainty 0.1 -hold [get_clocks {GATED_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {GATED_CLK}]
set_clock_uncertainty 0.1 -hold [get_clocks {SCAN_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {SCAN_CLK}]
set_clock_groups -name REF_CLK_1 -asynchronous  -group  [get_clocks {GATED_CLK REF_CLK}] -group  [get_clocks {RX_CLK TX_CLK UART_CLK}] -group  [get_clocks {SCAN_CLK}]
